tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "mongodb/brew"
cask "osxfuse"

brew "mas"
brew "coreutils"
brew "git"
brew "gh"
brew "hub"
brew "curl"
brew "wget"
brew "neofetch"
brew "stow"
brew "ifstat"
brew "netcat"
brew "ripgrep"
brew "tree"
brew "watchman"
brew "ack"
brew "exa"
brew "feh"
brew "htop"
brew "fzf"
brew "automake"
brew "autoconf"
brew "cmake"
brew "pkg-config"
brew "speedtest-cli"
brew "asciinema"
brew "cocoapods"
brew "youtube-dl"
brew "serve"

brew "docker"
brew "minikube"
brew "kubernetes-cli"
brew "helm"
brew "meilisearch"
brew "elasticsearch@6"
brew "awscli"
brew "pgcli"
brew "fastlane"

brew "fish"
brew "neovim", args: ["HEAD"]
brew "tmux"
brew "reattach-to-user-namespace"
cask "iterm2"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"

brew "apktool"
brew "nmap"
brew "wireshark"
brew "mitmproxy"

brew "pngcheck"
brew "graphicsmagick"
brew "ffmpeg"
brew "webp"

brew "node"
brew "nvm"
brew "yarn"
brew "deno"
brew "python@3.9"
cask "adoptopenjdk8"
brew "mono"
brew "go"
brew "elixir"
brew "rust"
brew "ruby"

brew "redis", restart_service: true
brew "postgresql", restart_service: true
brew "mongodb/brew/mongodb-community"
brew "mysql"
brew "sqlite"

brew "ios-deploy"
brew "scrcpy"
cask "android-studio"
cask "android-platform-tools"

cask "obs"
cask "visual-studio-code"
cask "spotify"
cask "chromium"
cask "firefox-developer-edition"
cask "notion"
cask "mactex"
cask "mongodb-compass"
cask "postman"
cask "datagrip"
cask "intellij-idea"
cask "google-cloud-sdk"
cask "texstudio"
cask "whatsapp"
cask "discord"
cask "figma"
cask "paragon-ntfs"
cask "minecraft"
cask "istat-menus"
cask "zoom"
cask "cold-turkey-blocker"

mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
mas "LINE", id: 539883307
